In [6]:
import pandas as pd

In [4]:
cycling_data = [10.7, 0, None, 2.4, 15.3, 10.9, 0, None]
step_data = [3620, 7891, 9761, 3907, 4338, 5373]

In [5]:
joined_data = list(zip(step_data, cycling_data))

In [8]:
activity_df = pd.DataFrame(joined_data)

In [9]:
activity_df

      0     1
0  3620  10.7
1  7891   0.0
2  9761   NaN
3  3907   2.4
4  4338  15.3
5  5373  10.9

In [10]:
activity_df = pd.DataFrame(joined_data, index = pd.date_range('20150329', periods = 6),
                          columns = ['Walking','Cycling'])
activity_df

            Walking  Cycling
2015-03-29     3620     10.7
2015-03-30     7891      0.0
2015-03-31     9761      NaN
2015-04-01     3907      2.4
2015-04-02     4338     15.3
2015-04-03     5373     10.9

In [11]:
activity_df.loc['2015-04-01']

Walking    3907.0
Cycling       2.4
Name: 2015-04-01 00:00:00, dtype: float64

In [12]:
activity_df.iloc[-3]

Walking    3907.0
Cycling       2.4
Name: 2015-04-01 00:00:00, dtype: float64

In [13]:
activity_df['Walking']

2015-03-29    3620
2015-03-30    7891
2015-03-31    9761
2015-04-01    3907
2015-04-02    4338
2015-04-03    5373
Freq: D, Name: Walking, dtype: int64

In [33]:
activity_df.iloc[:,0]

2015-03-29    3620
2015-03-30    7891
2015-03-31    9761
2015-04-01    3907
2015-04-02    4338
2015-04-03    5373
Freq: D, Name: Walking, dtype: int64